/* Closes the console and opens the lastest file in CONPARK for me */
Parse Upper Arg fileno .
If fileno='' Then fileno=1
Address COMMAND 'CP CLOSE CONS'
Address COMMAND 'CP SLEEP 2 SEC'
Address CMS 'CONPARK * 'fileno
