/*---------------------------------------------------------------+
| Function : Check some of the monitoring settings               |
|                                                                |
| File     : QSMONITO EXEC                                       |
+----------------------------------------------------------------+
| Version  : 1.1.0                                               |
|                                                                |
| Files    : QSMONITO REPORT Output                              |
|            SICONV   REXX   Pipe stage                          |
|                                                                |
| Called   : QSMONITO <how>  ( <dryrun>                          |
|                                                                |
|            <how>    empty  Defaults to CONS                    |
|                     CONS   Show output on console              |
|                     FILE   Stores output in QSMONITO REPORT    |
|                     PIPE   Hands output to calling EXEC        |
|                                                                |
| Comments : .                                                   |
|                                                                |
| Author   : H.T.Kramer, ,                                       |
| Created  : 20211019 12:00:55                                   |
| Changes  : .                                                   |
|                                                                |
+---------------------------------------------------------------*/
Parse Upper Arg how '(' dryrun .
Parse Source . . myfn myft .
recomm.0=0                                       /* Init some stems  */
work.0=0                                         /* Stem 2 append to */
stemname='report.'                               /* Stem of caller   */
/*---------------------------------------------------------------+
| Decide depending on the input where the output goes            |
+---------------------------------------------------------------*/
Say TimeStamp()
Select
When how=''     Then output='| cons'
When how='CONS' Then output='| cons'
When how='FILE' Then output='| > 'myfn' REPORT A'
When how='PIPE' Then output='| stem 'stemname' 1 append'
When how='?'    Then Do
                     'PIPE (NAME QSMONITO.EXEC:40 END ?)',
                        '< 'myfn myft' *',
                        '| tolabel Parse',
                        '| cons'
                     Exit
                     End
Otherwise Exit 28
End
/*---------------------------------------------------------------+
| Composing the header                                           |
+---------------------------------------------------------------*/
'PIPE (NAME QSMONITO.EXEC:51 END ?)',
   'literal 'TimeStamp(),                        /* Compose header   */
   '| var monitor_header 1',                     /* .                */
   '| join * x40',                               /* .                */
   '| var monitor_header'                        /* .                */
/*---------------------------------------------------------------+
| Collect some info                                              |
+---------------------------------------------------------------*/
Call GetInfo
/*---------------------------------------------------------------+
| Evaluate the results                                           |
+---------------------------------------------------------------*/
If perfid.0=0 Then msg='; ;No known PERFKIT users running'
              Else msg='; ;The following default PERFKIT users are running'
Call Add2Output 'perfid.,'msg
/*---------------------------------------------------------------+
| Check if PERFKIT is running and if we are allowed to use it    |
+---------------------------------------------------------------*/
Do p=1 To perfid.0
    perfnotaut='1'
    perfrun='0'
    'PIPE (NAME QSMONITO.EXEC:72 END ?)',
       'vmc 'perfid.p' MENU',                    /* Talk 2 a possible*/
       '| p: pick w1.1 == ~FCXVMC040E~',         /* Nope not running */
       '| specs ~'perfid.p'~ 1 1;* nw',          /* Add id           */
       '| count lines',                          /* Count lines      */
       '| var perfnotauth',                      /* Set var          */
       '? p:',                                   /* Conn 2 pick      */
       '| pick w1.1 ==  ~FCX124~',               /* Yep running      */
       '| count lines',                          /* How many         */
       '| var perfrun'                           /* Set var          */
   If perfrun         Then msg='Userid 'perfid.p' is running PERFKIT'
                      Else msg='Userid 'perfid.p' is NOT running PERFKIT'
   Call Add2Output 'msg,; ;'
   If perfnotauth Then msg='Userid 'perfid.p' is running but we ('Userid()') are NOT authorised'
                  Else msg='Userid 'perfid.p' is running we are authorised'
   Call Add2Output 'msg,; ;'
End p
If monint < 60 | monint > 60  Then Do
       msg='; ;Monitoring interval is best at 60 seconds: 'monint
       Call Add2Output 'msg'
       End
msg='; ;Monitor settings that have been checked; ;'
       Call Add2Output 'msg'
Do m=1 To monset.0
   Parse Value monset.m With . dom . sw .
   displ=Subword(monset.m,1,3)
   Select
   When dom='MONITOR'   & \sw Then recomm='ENABLE MONITORING'
   When dom='SYSTEM'    & \sw Then recomm='ENABLE SYSTEM for monitoring'
   when dom='APPLDATA'  & \sw Then recomm='ENABLE when cms applications are going haywire, lots of data!!'
   when dom='APPLDATA'  &  sw Then recomm='DISABLE when there are no problems'
   when dom='COMMAND'   & \sw Then recomm='ENABLE if you need your commands monitored'
   when dom='I/O'       & \sw Then recomm='If there are I/O constraints ENABLE this'
   when dom='I/O'       &  sw Then recomm='DISABLE if you do not have problematic I/O'
   when dom='ISFC'      & \sw Then recomm='If ISFC is playing up ENABLE this'
   when dom='ISFC'      &  sw Then recomm='DISABLE when no ISFC problems found'
   when dom='NETWORK'   & \sw Then recomm='If NETWORK is troublesome ENABLE this'
   when dom='PROCESSOR' & \sw Then recomm='ENABLE when CPU thruput is a problem'
   when dom='SCHEDULER' & \sw Then recomm='ENABLE this when tasks are incomplete'
   when dom='SEEKS'     & \sw Then recomm='When DASD is giving delays ENABLE this'
   when dom='SEEKS'     &  sw Then recomm='DISABLE when you do not have DASD problems'
   when dom='SSI'       & \sw Then recomm='When SSI is troubling you ENABLE SSI'
   when dom='STORAGE'   & \sw Then recomm='If STORAGE is a constraint ENABLE this'
   when dom='USER'      & \sw Then recomm='When USERs have high resource consumption ENABLE this '
   when dom='USER'      &  sw Then recomm='DISABLE if USERs do not have problems'
   Otherwise recomm=''
   End
   msg=displ' :  'recomm
   Call Add2OutPut 'msg'
End
/*---------------------------------------------------------------+
| Here we return output to our caller                            |
+---------------------------------------------------------------*/
banr=Center(' 'myfn' ',80,'-')
'PIPE (NAME QSMONITO.EXEC:126 END ?)',
    'stem work.',                                /* Take these       */
    '| preface var banr',
    '| preface var monitor_header',              /* Add header       */
    '| preface literal ',                        /* Add 2 empties    */
    '| preface literal ',                        /* .                */
    '| append var banr',                         /* Add 2 stem       */
    output                                       /* Hand back        */
Exit
 
 
TimeStamp:
Return Date(S) Time() myfn
 
 
Add2Output:
/*---------------------------------------------------------------+
| Adding stuff to an existing stem                               |
+---------------------------------------------------------------*/
Parse Arg input','header
If LastPos('.',input)<>0 Then input='stem 'input
                         Else input='var 'input
'PIPE (NAME QSMONITO.EXEC:148 END ?)',
     input,                                      /* Use input        */
     '| preface var header',                     /* Add header       */
     '| split at ;',                             /* Split here       */
     '| stem work. append'
Return
 
 
CheckSwitches:
/*---------------------------------------------------------------+
| Check how some of the switches are set and make them boolean   |
+---------------------------------------------------------------*/
Parse Arg bool . switch .
switch=Word(event_pcif,2)
Select
When pcif  & switch='ENABLED'  Then ena='0'
When pcif  & switch='DISABLED' Then ena=1
When \pcif & switch='ENABLED'  Then ena=0
When \pcif & switch='DISABLED' Then ena='1'
End
Return
 
 
GetInfo:
/*---------------------------------------------------------------+
| Get various details from the system                            |
+---------------------------------------------------------------*/
perfids='PERFSVM PERSMAPI'
perfid.0=0
'PIPE (NAME QSMONITO.EXEC:177 END ?)',
    'var perfids',                               /* Take these       */
    '| split',                                   /* Split            */
    '| specs ~QUERY~ 1 w1.1 nw',                 /* Compose cmds     */
    '| cp',                                      /* Issue cmds       */
    '| pick w3.1 == ~DSC~',                      /* If this          */
    '| specs w1.1',                              /* Keep this        */
    '| stem perfid.',                            /* Store as         */
    '?',                                         /* 2nd pipe         */
    'cp QUERY SSI',                              /* Are we on SSI    */
    '| count lines',                             /* How many?        */
    '| if1: if pick w2.1 > ~1~',                 /* If it is 1       */
    '|     specs ~1~ 1',                         /* ...we set this   */
    '| if1:',                                    /* Conn 2 if        */
    '|     specs ~0~ 1',                         /* ... otherwise.   */
    '| if1:',                                    /* Conn 2 if        */
    '| var ssi',                                 /* Store as         */
    '?',                                         /* 3rd pipe         */
    'cp QUERY ISFC TRANSPORT ALL',               /* Do we have this  */
    '| frtarget pick anycase w1.1 == ~SENT:~',   /* Take from here   */
    '| strip',                                   /* Remove spaces    */
    '| change ~ ~_~ 1',                          /* Replace this     */
    '| specs printonly eof',                     /* Add up the       */
            'a: w2.1 .',                         /* ...counters      */
            'set #0+=a',                         /* .                */
            'eof',                               /* .                */
            'print #0 1',                        /* .                */
    '| if2: if pick w1.1 \== ~0~',               /* If it is zero    */
    '|    specs ~1~ 1',                          /* ...no ISFC       */
    '| if2:',                                    /* Conn 2 if        */
    '| strip',                                   /* ..remove spaces  */
    '| var isfc',                                /* Store as         */
    '?',                                         /* 4th pipe         */
    'cp QUERY PCIF',                             /* Do we have pcif  */
    '| if4: if pick anycase w-2;-1 == ~NOT FOUND.~',   /* Look for this    */
    '|     specs ~0~',                           /* Then we set it   */
    '| if4:',                                    /* Conn 2 if        */
    '|     specs ~1~',                           /* Otherwise this   */
    '| if4:',                                    /* Conn 2 if        */
    '| var pcif',                                /* Set var          */
    '?',                                         /* 5th pipe         */
    'cp QUERY MONITOR INTERVAL',                 /* Ask cp           */
    '| specs w3.2',                              /* Keep this        */
    '| if3: if pick w2.1 == ~MINUTES~',          /* If this          */
    '|   specs a: w1.1 .',                       /* Rework to        */
              'set #0:=a*60',                    /* ...seconds       */
              'print #0 1',                      /* .                */
    '| if3:',                                    /* Conn 2 if        */
    '|   specs w1.1 1',                          /* ...we keep this  */
    '| if3:',                                    /* Conn 2 if        */
    '| strip',                                   /* Remove spaces    */
    '| var monint',                              /* Set var          */
    '?',                                         /* 6th pipe         */
    'cp QUERY MONITOR SAMPLE',
    '| drop first 7',
    '| specs ~SAMPLE~ 1 w1.1 nw.9 w3.1 nw',
    '| fi: fanin',
    '| if: if pick w3.1 == ~ENABLED~',
    '|       specs 1;* 1 ~ 1~ nw',
    '| if:',
    '|       specs 1;* 1 ~0~ nw',
    '| if:',
    '| stem monset.',
    '?',
    'cp QUERY MONITOR EVENT',
    '| drop first 5',
    '| specs ~EVENT ~ 1 w1.1 nw.9 w3.1 nw',
    '| fi:'
Return
